Synwit-Co-Ltd/SWM241_UserBoot/SWM241_UserBoot/CSL/CMSIS/DeviceSupport/SWM241.h
#ifndef __SWM241_H__
#define __SWM241_H__

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */
typedef enum IRQn
{
/******  Cortex-M0 Processor Exceptions Numbers **********************************************/
  NonINTMableInt_IRQn = -14,	/*!< 2 Non INTMable Interrupt								 */
  HardFault_IRQn	  = -13,	/*!< 3 Cortex-M0 Hard Fault Interrupt						 */
  SVCall_IRQn		  = -5,	 /*!< 11 Cortex-M0 SV Call Interrupt						     */
  PendSV_IRQn		  = -2,	 /*!< 14 Cortex-M0 Pend SV Interrupt						     */
  SysTick_IRQn		  = -1,	 /*!< 15 Cortex-M0 System Tick Interrupt					     */

/******  Cortex-M0 specific Interrupt Numbers ************************************************/
  UART0_IRQn                  = 0,
  TIMR0_IRQn                  = 1,
  SPI0_IRQn                   = 2,
  UART1_IRQn                  = 3,
  UART2_IRQn                  = 4,
  TIMR1_IRQn                  = 5,
  DMA_IRQn                    = 6,
  PWM0_IRQn                   = 7,
  I2C1_IRQn                   = 8,
  TIMR2_IRQn                  = 9,
  TIMR3_IRQn                  = 10,
  WDT_IRQn                    = 11,
  I2C0_IRQn                   = 12,
  UART3_IRQn                  = 13,
  ADC_IRQn                    = 14,
  TIMR4_IRQn                  = 15,
  GPIOC0_GPIOD1_IRQn          = 16,
  GPIOB1_GPIOC2_IRQn          = 17,
  TIMR5_GPIOC3_IRQn           = 18,
  GPIOA0_GPIOD6_IRQn          = 19,
  TIMR6_GPIOC1_IRQn           = 20,
  GPIOA1_GPIOD8_IRQn          = 21,
  GPIOB7_GPIOD9_IRQn          = 22,
  GPIOB5_GPIOD10_IRQn         = 23,
  GPIOA2_GPIOB2_GPIOD13_IRQn  = 24,
  TIMR7_XTALSTOP_GPIOD12_IRQn = 25,
  PWM1_GPIOA_IRQn             = 26,
  PWM2_GPIOB_IRQn             = 27,
  BOD_PWMBRK_GPIOD11_IRQn     = 28,
  PWM3_GPIOC_SAFETY_IRQn      = 29,
  SPI1_HALL_GPIOA9_IRQn       = 30,
  RTC_GPIOD_IRQn              = 31
} IRQn_Type;

/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __MPU_PRESENT		    0	   /*!< UART does not provide a MPU present or not	     */
#define __NVIC_PRIO_BITS		2	   /*!< UART Supports 2 Bits for the Priority Levels	 */
#define __Vendor_SysTickConfig  0	   /*!< Set to 1 if different SysTick Config is used	 */

#if   defined ( __CC_ARM )
  #pragma anon_unions
#endif

#include <stdio.h>
#include "core_cm0.h"				   /* Cortex-M0 processor and core peripherals		     */
#include "system_SWM241.h"


/******************************************************************************/
/*				Device Specific Peripheral registers structures			 */
/******************************************************************************/
typedef struct {
	__IO uint32_t CLKSEL;				    //Clock Select

	__IO uint32_t CLKDIVx_ON;				//[0] CLK_DIVx时钟源开关

	__IO uint32_t CLKEN0;					//Clock Enable
	
	__IO uint32_t CLKEN1;

	__IO uint32_t SLEEP;
	
	uint32_t RESERVED[4];
	
	__IO uint32_t RSTSR;					//Reset Status
	
	uint32_t RESERVED2[2];
	
	__IO uint32_t RTCWKCR;					//RTC Wakeup Control
	
	__IO uint32_t RTCWKSR;
	
	uint32_t RESERVED3[2];
	
	__IO uint32_t SYSIE;
	
	__IO uint32_t SYSIF;
	
	__IO uint32_t RAMERR;
	
	uint32_t RESERVED4[13];
	
	__I  uint32_t CHIPID[4];
	
	__IO uint32_t BACKUP[4];
	
	 uint32_t RESERVED5[12];

	__IO uint32_t PRNGCR;
	__IO uint32_t PRNGDL;
	__IO uint32_t PRNGDH;

	uint32_t RESERVED6[9];
		 
	__IO uint32_t PAWKEN;				    //PORTA Wakeup Enable
	__IO uint32_t PBWKEN;
	__IO uint32_t PCWKEN;
	__IO uint32_t PDWKEN;
	
    uint32_t RESERVED7[8];

	__IO uint32_t PAWKSR;				    //PORTA Wakeup Status，写1清零
	__IO uint32_t PBWKSR;
	__IO uint32_t PCWKSR;
	__IO uint32_t PDWKSR;
	
	uint32_t RESERVED8[(0x720-0x13C)/4-1];
	
	__IO uint32_t PRSTEN;					//外设复位使能，只有当PRSTEN的值为0x55时，才能写PRSTR1、PRSTR2
	__IO uint32_t PRSTR0;
	__IO uint32_t PRSTR1;

    //Analog Control: 0x400AA000
    uint32_t RESERVED9[(0x400AA000-0x40000728)/4-1];
	
	__IO uint32_t HRCCR;					//High speed RC Control Register
	uint32_t RESERVED10[3];
    
    __IO uint32_t BODCR;
	__IO uint32_t BODSR;
	
	uint32_t RESERVED11[2];
	
	__IO uint32_t XTALCR;
	__IO uint32_t XTALSR;
	
	uint32_t RESERVED12[10];
	
    __IO uint32_t LRCCR;					//Low speed RC Control Register
} SYS_TypeDef;


#define SYS_CLKSEL_SYS_Pos			0		//系统时钟选择	1 HRC	0 CLK_DIVx
#define SYS_CLKSEL_SYS_Msk			(0x01 << SYS_CLKSEL_SYS_Pos)
#define SYS_CLKSEL_CLK_DIVx_Pos		1		//选择CLK_DIVx  0 CLK_DIV1   1 CLK_DIV8
#define SYS_CLKSEL_CLK_DIVx_Msk		(0x01 << SYS_CLKSEL_CLK_DIVx_Pos)
#define SYS_CLKSEL_CLK_Pos			2		//Clock Source	0 LRC   2 XTAL_32K   3 XTAL   4 HRC
#define SYS_CLKSEL_CLK_Msk			(0x07 << SYS_CLKSEL_CLK_Pos)
#define SYS_CLKSEL_RTC_Pos			5		//RTC时钟源选择  0 LRC   1 XTAL_32K
#define SYS_CLKSEL_RTC_Msk			(0x01 << SYS_CLKSEL_RTC_Pos)
#define SYS_CLKSEL_WDT_Pos			12		//看门狗时钟选择  0 HRC   1 XTAL   2 LRC   3 XTAL_32K
#define SYS_CLKSEL_WDT_Msk			(0x03 << SYS_CLKSEL_WDT_Pos)
#define SYS_CLKSEL_RTCTRIM_Pos		14		//RTC Trim参考时钟  0 XTAL   1 XTAL/2   2 XTAL/4   3 XTAL/8
#define SYS_CLKSEL_RTCTRIM_Msk		(0x03 << SYS_CLKSEL_RTCTRIM_Pos)
#define SYS_CLKSEL_ADC_Pos			16		//ADC时钟选择  0 HRC   1 XTAL   2 PLL   3 PLL
#define SYS_CLKSEL_ADC_Msk			(0x03 << SYS_CLKSEL_ADC_Pos)
#define SYS_CLKSEL_ADCDIV_Pos		18		//ADC时钟分频  0 1分频   1 1分频   2 4分频   3 8分频
#define SYS_CLKSEL_ADCDIV_Msk		(0x03 << SYS_CLKSEL_ADCDIV_Pos)
#define SYS_CLKSEL_WKUP_Pos			24
#define SYS_CLKSEL_WKUP_Msk			(0x01 << SYS_CLKSEL_WKUP_Pos)

#define SYS_CLKDIV_ON_Pos           0
#define SYS_CLKDIV_ON_Msk           (0x01 << SYS_CLKDIV_ON_Pos)

#define SYS_CLKEN0_GPIOA_Pos		0
#define SYS_CLKEN0_GPIOA_Msk		(0x01 << SYS_CLKEN0_GPIOA_Pos)
#define SYS_CLKEN0_GPIOB_Pos		1
#define SYS_CLKEN0_GPIOB_Msk		(0x01 << SYS_CLKEN0_GPIOB_Pos)
#define SYS_CLKEN0_GPIOC_Pos		2
#define SYS_CLKEN0_GPIOC_Msk		(0x01 << SYS_CLKEN0_GPIOC_Pos)
#define SYS_CLKEN0_GPIOD_Pos		3
#define SYS_CLKEN0_GPIOD_Msk		(0x01 << SYS_CLKEN0_GPIOD_Pos)
#define SYS_CLKEN0_UART0_Pos		6
#define SYS_CLKEN0_UART0_Msk		(0x01 << SYS_CLKEN0_UART0_Pos)
#define SYS_CLKEN0_UART1_Pos		7
#define SYS_CLKEN0_UART1_Msk		(0x01 << SYS_CLKEN0_UART1_Pos)
#define SYS_CLKEN0_UART2_Pos		8
#define SYS_CLKEN0_UART2_Msk		(0x01 << SYS_CLKEN0_UART2_Pos)
#define SYS_CLKEN0_UART3_Pos		9
#define SYS_CLKEN0_UART3_Msk		(0x01 << SYS_CLKEN0_UART3_Pos)
#define SYS_CLKEN0_WDT_Pos			10
#define SYS_CLKEN0_WDT_Msk			(0x01 << SYS_CLKEN0_WDT_Pos)
#define SYS_CLKEN0_TIMR_Pos			11
#define SYS_CLKEN0_TIMR_Msk			(0x01 << SYS_CLKEN0_TIMR_Pos)
#define SYS_CLKEN0_PWM_Pos			12
#define SYS_CLKEN0_PWM_Msk			(0x01 << SYS_CLKEN0_PWM_Pos)
#define SYS_CLKEN0_SPI0_Pos			13
#define SYS_CLKEN0_SPI0_Msk			(0x01 << SYS_CLKEN0_SPI0_Pos)
#define SYS_CLKEN0_SPI1_Pos			14
#define SYS_CLKEN0_SPI1_Msk			(0x01 << SYS_CLKEN0_SPI1_Pos)
#define SYS_CLKEN0_I2C0_Pos			15
#define SYS_CLKEN0_I2C0_Msk			(0x01 << SYS_CLKEN0_I2C0_Pos)
#define SYS_CLKEN0_I2C1_Pos			16
#define SYS_CLKEN0_I2C1_Msk			(0x01 << SYS_CLKEN0_I2C1_Pos)
#define SYS_CLKEN0_CRC_Pos			19
#define SYS_CLKEN0_CRC_Msk			(0x01 << SYS_CLKEN0_CRC_Pos)
#define SYS_CLKEN0_DIV_Pos			21
#define SYS_CLKEN0_DIV_Msk			(0x01 << SYS_CLKEN0_DIV_Pos)
#define SYS_CLKEN0_ANAC_Pos			25		//模拟控制单元时钟使能
#define SYS_CLKEN0_ANAC_Msk			(0x01 << SYS_CLKEN0_ANAC_Pos)
#define SYS_CLKEN0_ADC_Pos			26
#define SYS_CLKEN0_ADC_Msk			(0x01 << SYS_CLKEN0_ADC_Pos)
#define SYS_CLKEN0_CAN_Pos			28
#define SYS_CLKEN0_CAN_Msk			(0x01 << SYS_CLKEN0_CAN_Pos)
#define SYS_CLKEN0_SLCD_Pos			29
#define SYS_CLKEN0_SLCD_Msk			(0x01 << SYS_CLKEN0_SLCD_Pos)
#define SYS_CLKEN0_SLED_Pos			31
#define SYS_CLKEN0_SLED_Msk			(0x01u<< SYS_CLKEN0_SLED_Pos)
		
#define SYS_CLKEN1_RTC_Pos			19
#define SYS_CLKEN1_RTC_Msk			(0x01 << SYS_CLKEN1_RTC_Pos)

