Synwit-Co-Ltd/SWM241_UserBoot/SWM241_UserBoot/CSL/CMSIS/DeviceSupport/SWM241.h
#define SYS_SLEEP_SLEEP_Pos			0		//将该位置1后，系统将进入SLEEP模式
#define SYS_SLEEP_SLEEP_Msk			(0x01 << SYS_SLEEP_SLEEP_Pos)
#define SYS_SLEEP_STOP_Pos			1		//将该位置1后，系统将进入STOP SLEEP模式
#define SYS_SLEEP_STOP_Msk			(0x01 << SYS_SLEEP_STOP_Pos)

#define SYS_RSTSR_POR_Pos			0		//1 出现过POR复位，写1清零
#define SYS_RSTSR_POR_Msk			(0x01 << SYS_RSTSR_POR_Pos)
#define SYS_RSTSR_WDT_Pos			1		//1 出现过WDT复位，写1清零
#define SYS_RSTSR_WDT_Msk			(0x01 << SYS_RSTSR_WDT_Pos)
#define SYS_RSTSR_IAA_Pos			4		//Illegal Address Access
#define SYS_RSTSR_IAA_Msk			(0x01 << SYS_RSTSR_IAA_Pos)

#define SYS_RTCWKCR_EN_Pos			0		//RTC唤醒使能
#define SYS_RTCWKCR_EN_Msk			(0x01 << SYS_RTCWKCR_EN_Pos)

#define SYS_RTCWKSR_FLAG_Pos		0		//RTC唤醒标志，写1清零
#define SYS_RTCWKSR_FLAG_Msk		(0x01 << SYS_RTCWKSR_FLAG_Pos)

#define SYS_PRSTR0_GPIOA_Pos		0		//1 复位GPIOA    0 不复位
#define SYS_PRSTR0_GPIOA_Msk		(0x01 << SYS_PRSTR0_GPIOA_Pos)
#define SYS_PRSTR0_GPIOB_Pos		1
#define SYS_PRSTR0_GPIOB_Msk		(0x01 << SYS_PRSTR0_GPIOB_Pos)
#define SYS_PRSTR0_GPIOC_Pos		2
#define SYS_PRSTR0_GPIOC_Msk		(0x01 << SYS_PRSTR0_GPIOC_Pos)
#define SYS_PRSTR0_GPIOD_Pos		3
#define SYS_PRSTR0_GPIOD_Msk		(0x01 << SYS_PRSTR0_GPIOD_Pos)
#define SYS_PRSTR0_UART0_Pos		6
#define SYS_PRSTR0_UART0_Msk		(0x01 << SYS_PRSTR0_UART0_Pos)
#define SYS_PRSTR0_UART1_Pos		7
#define SYS_PRSTR0_UART1_Msk		(0x01 << SYS_PRSTR0_UART1_Pos)
#define SYS_PRSTR0_UART2_Pos		8
#define SYS_PRSTR0_UART2_Msk		(0x01 << SYS_PRSTR0_UART2_Pos)
#define SYS_PRSTR0_UART3_Pos		9
#define SYS_PRSTR0_UART3_Msk		(0x01 << SYS_PRSTR0_UART3_Pos)
#define SYS_PRSTR0_WDT_Pos			10
#define SYS_PRSTR0_WDT_Msk			(0x01 << SYS_PRSTR0_WDT_Pos)
#define SYS_PRSTR0_TIMR_Pos			11
#define SYS_PRSTR0_TIMR_Msk			(0x01 << SYS_PRSTR0_TIMR_Pos)
#define SYS_PRSTR0_PWM_Pos			12
#define SYS_PRSTR0_PWM_Msk			(0x01 << SYS_PRSTR0_PWM_Pos)
#define SYS_PRSTR0_SPI0_Pos			13
#define SYS_PRSTR0_SPI0_Msk			(0x01 << SYS_PRSTR0_SPI0_Pos)
#define SYS_PRSTR0_SPI1_Pos			14
#define SYS_PRSTR0_SPI1_Msk			(0x01 << SYS_PRSTR0_SPI1_Pos)
#define SYS_PRSTR0_I2C0_Pos			15
#define SYS_PRSTR0_I2C0_Msk			(0x01 << SYS_PRSTR0_I2C0_Pos)
#define SYS_PRSTR0_I2C1_Pos			16
#define SYS_PRSTR0_I2C1_Msk			(0x01 << SYS_PRSTR0_I2C1_Pos)
#define SYS_PRSTR0_CRC_Pos			19
#define SYS_PRSTR0_CRC_Msk			(0x01 << SYS_PRSTR0_CRC_Pos)
#define SYS_PRSTR0_DIV_Pos			21
#define SYS_PRSTR0_DIV_Msk			(0x01 << SYS_PRSTR0_DIV_Pos)
#define SYS_PRSTR0_ANAC_Pos			25
#define SYS_PRSTR0_ANAC_Msk			(0x01 << SYS_PRSTR0_ANAC_Pos)
#define SYS_PRSTR0_ADC0_Pos			26
#define SYS_PRSTR0_ADC0_Msk			(0x01 << SYS_PRSTR0_ADC0_Pos)
#define SYS_PRSTR0_CAN_Pos			28
#define SYS_PRSTR0_CAN_Msk			(0x01u<< SYS_PRSTR0_CAN_Pos)
#define SYS_PRSTR0_SLCD_Pos			29
#define SYS_PRSTR0_SLCD_Msk			(0x01u<< SYS_PRSTR0_SLCD_Pos)
#define SYS_PRSTR0_SLED_Pos			31
#define SYS_PRSTR0_SLED_Msk			(0x01u<< SYS_PRSTR0_SLED_Pos)

#define SYS_PRSTR1_RTC_Pos			19
#define SYS_PRSTR1_RTC_Msk			(0x01 << SYS_PRSTR1_RTC_Pos)

#define SYS_HRCCR_ON_Pos			0		//High speed RC ON
#define SYS_HRCCR_ON_Msk			(0x01 << SYS_HRCCR_ON_Pos)

#define SYS_BODCR_IE_Pos		    1		//Interrupt Enable
#define SYS_BODCR_IE_Msk		    (0x01 << SYS_BODCR_IE_Pos)
#define SYS_BODCR_INTLVL_Pos		4		//BOD中断触发电平，0 1.9V   1 2.1V   2 2.3V   3 2.5V   4 2.7V   5 3.5V   6 4.1V
#define SYS_BODCR_INTLVL_Msk		(0x07 << SYS_BODCR_INTLVL_Pos)
#define SYS_BODCR_RSTLVL_Pos		7		//BOD复位电平，0 1.7V   1 1.9V   2 2.1V   3 2.7V   4 3.5V
#define SYS_BODCR_RSTLVL_Msk		(0x07 << SYS_BODCR_RSTLVL_Pos)

#define SYS_BODSR_IF_Pos			0		//中断标志，写1清零
#define SYS_BODSR_IF_Msk			(0x01 << SYS_BODSR_IF_Pos)

#define SYS_XTALCR_32KON_Pos		0		//XTAL_32K On
#define SYS_XTALCR_32KON_Msk		(0x01 << SYS_XTALCR_32KON_Pos)
#define SYS_XTALCR_ON_Pos			1		//XTAL On
#define SYS_XTALCR_ON_Msk			(0x01 << SYS_XTALCR_ON_Pos)
#define SYS_XTALCR_32KDET_Pos		4		//XTAL_32K Stop Detect
#define SYS_XTALCR_32KDET_Msk		(0x01 << SYS_XTALCR_32KDET_Pos)
#define SYS_XTALCR_DET_Pos			5		//XTAL Stop Detect
#define SYS_XTALCR_DET_Msk			(0x01 << SYS_XTALCR_DET_Pos)
#define SYS_XTALCR_32KDRV_Pos		8		//XTAL_32K 驱动能力，可微调频率
#define SYS_XTALCR_32KDRV_Msk		(0x0F << SYS_XTALCR_32KDRV_Pos)
#define SYS_XTALCR_DRV_Pos			16		//XTAL 驱动能力，可微调频率
#define SYS_XTALCR_DRV_Msk			(0x1F << SYS_XTALCR_DRV_Pos)

#define SYS_XTALSR_32KSTOP_Pos		0		//XTAL_32K Stop，写1清零
#define SYS_XTALSR_32KSTOP_Msk		(0x01 << SYS_XTALSR_32KSTOP_Pos)
#define SYS_XTALSR_STOP_Pos			1		//XTAL Stop，写1清零
#define SYS_XTALSR_STOP_Msk			(0x01 << SYS_XTALSR_STOP_Pos)

#define SYS_LRCCR_ON_Pos			0		//Low Speed RC On
#define SYS_LRCCR_ON_Msk			(0x01 << SYS_LRCCR_ON_Pos)




typedef struct {
	__IO uint32_t FUNSEL0;
	
	__IO uint32_t FUNSEL1;
	
		 uint32_t RESERVED[62];
	
	__IO uint32_t PULLU;                    //PULLU[n]为 PINn引脚 上拉使能位： 1 上拉使能	0 上拉禁止
	
		 uint32_t RESERVED2[63];
	
	__IO uint32_t PULLD;                    //PULLD[n]为 PINn引脚 下拉使能位： 1 下拉使能	0 下拉禁止
	
		 uint32_t RESERVED3[63];
	
	__IO uint32_t INEN;                     //INEN[n] 为 PINn引脚 输入使能位： 1 输入使能	0 输入禁止
	
		 uint32_t RESERVED4[63];
	
	__IO uint32_t OPEND;                    //OPEND[n]为 PINn引脚 开漏使能位： 1 开漏使能	0 开漏禁止
} PORT_TypeDef;


#define PORT_FUNSEL0_PIN0_Pos		0
#define PORT_FUNSEL0_PIN0_Msk		(0x0F << PORT_FUNSEL0_PIN0_Pos)
#define PORT_FUNSEL0_PIN1_Pos		4
#define PORT_FUNSEL0_PIN1_Msk		(0x0F << PORT_FUNSEL0_PIN1_Pos)
#define PORT_FUNSEL0_PIN2_Pos		8
#define PORT_FUNSEL0_PIN2_Msk		(0x0F << PORT_FUNSEL0_PIN2_Pos)
#define PORT_FUNSEL0_PIN3_Pos		12
#define PORT_FUNSEL0_PIN3_Msk		(0x0F << PORT_FUNSEL0_PIN3_Pos)
#define PORT_FUNSEL0_PIN4_Pos		16
#define PORT_FUNSEL0_PIN4_Msk		(0x0F << PORT_FUNSEL0_PIN4_Pos)
#define PORT_FUNSEL0_PIN5_Pos		20
#define PORT_FUNSEL0_PIN5_Msk		(0x0F << PORT_FUNSEL0_PIN5_Pos)
#define PORT_FUNSEL0_PIN6_Pos		24
#define PORT_FUNSEL0_PIN6_Msk		(0x0F << PORT_FUNSEL0_PIN6_Pos)
#define PORT_FUNSEL0_PIN7_Pos		28
#define PORT_FUNSEL0_PIN7_Msk		(0x0Fu<< PORT_FUNSEL0_PIN7_Pos)

#define PORT_FUNSEL1_PIN8_Pos		0
#define PORT_FUNSEL1_PIN8_Msk		(0x0F << PORT_FUNSEL1_PIN8_Pos)
#define PORT_FUNSEL1_PIN9_Pos		4
#define PORT_FUNSEL1_PIN9_Msk		(0x0F << PORT_FUNSEL1_PIN9_Pos)
#define PORT_FUNSEL1_PIN10_Pos		8
#define PORT_FUNSEL1_PIN10_Msk		(0x0F << PORT_FUNSEL1_PIN10_Pos)
#define PORT_FUNSEL1_PIN11_Pos		12
#define PORT_FUNSEL1_PIN11_Msk		(0x0F << PORT_FUNSEL1_PIN11_Pos)
#define PORT_FUNSEL1_PIN12_Pos		16
#define PORT_FUNSEL1_PIN12_Msk		(0x0F << PORT_FUNSEL1_PIN12_Pos)
#define PORT_FUNSEL1_PIN13_Pos		20
#define PORT_FUNSEL1_PIN13_Msk		(0x0F << PORT_FUNSEL1_PIN13_Pos)
#define PORT_FUNSEL1_PIN14_Pos		24
#define PORT_FUNSEL1_PIN14_Msk		(0x0F << PORT_FUNSEL1_PIN14_Pos)
#define PORT_FUNSEL1_PIN15_Pos		28
#define PORT_FUNSEL1_PIN15_Msk		(0x0Fu<< PORT_FUNSEL1_PIN15_Pos)

