Synwit-Co-Ltd/SWM241_UserBoot/SWM241_UserBoot/CSL/CMSIS/DeviceSupport/SWM241.h
#define ADC_STAT_EOC_Pos			0		//写1清零
#define ADC_STAT_EOC_Msk			(0x01 << ADC_STAT_EOC_Pos)
#define ADC_STAT_OVF_Pos			1		//读数据寄存器清除
#define ADC_STAT_OVF_Msk			(0x01 << ADC_STAT_OVF_Pos)

#define ADC_DATA_VALUE_Pos			0		//溢出后，再次转换的数据会覆盖旧数据
#define ADC_DATA_VALUE_Msk			(0xFFF << ADC_DATA_VALUE_Pos)
#define ADC_DATA_CHNUM_Pos			12
#define ADC_DATA_CHNUM_Msk			(0x0F << ADC_DATA_CHNUM_Pos)

#define ADC_CHSEL_SW_Pos			0		//软件启动转换时采样的通道
#define ADC_CHSEL_SW_Msk			(0xFFF<< ADC_CHSEL_SW_Pos)
#define ADC_CHSEL_PWM_Pos			16		//PWM 启动转换时采样的通道
#define ADC_CHSEL_PWM_Msk			(0xFFF<< ADC_CHSEL_PWM_Pos)

#define ADC_FFSTAT_OVF_Pos			0
#define ADC_FFSTAT_OVF_Msk			(0x01 << ADC_FFSTAT_OVF_Pos)
#define ADC_FFSTAT_HFULL_Pos		1
#define ADC_FFSTAT_HFULL_Msk		(0x01 << ADC_FFSTAT_HFULL_Pos)
#define ADC_FFSTAT_FULL_Pos			2
#define ADC_FFSTAT_FULL_Msk			(0x01 << ADC_FFSTAT_FULL_Pos)
#define ADC_FFSTAT_EMPTY_Pos		3
#define ADC_FFSTAT_EMPTY_Msk		(0x01 << ADC_FFSTAT_EMPTY_Pos)
#define ADC_FFSTAT_LEVEL_Pos		4
#define ADC_FFSTAT_LEVEL_Msk		(0x07 << ADC_FFSTAT_LEVEL_Pos)

#define ADC_FFDATA_VALUE_Pos		0		//溢出后，再次转换的数据会被丢掉
#define ADC_FFDATA_VALUE_Msk		(0xFFF << ADC_FFDATA_VALUE_Pos)
#define ADC_FFDATA_CHNUM_Pos		12
#define ADC_FFDATA_CHNUM_Msk		(0x0F << ADC_FFDATA_CHNUM_Pos)

#define ADC_CTRL1_CLKSRC_Pos		0		//0 SYS->CLKSEL寄存器中设定    1 外部晶振
#define ADC_CTRL1_CLKSRC_Msk		(0x01 << ADC_CTRL1_CLKSRC_Pos)

#define ADC_CTRL2_ADCEVCM_Pos		1		//ADC External VCM，ADC与PGA输出共模电平选择
#define ADC_CTRL2_ADCEVCM_Msk		(0x01 << ADC_CTRL2_ADCEVCM_Pos)
#define ADC_CTRL2_PGAEVCM_Pos		2		//PGA External VCM，PGA输入共模电平选择
#define ADC_CTRL2_PGAEVCM_Msk		(0x01 << ADC_CTRL2_PGAEVCM_Pos)
#define ADC_CTRL2_PGAGAIN_Pos		3
#define ADC_CTRL2_PGAGAIN_Msk		(0x07 << ADC_CTRL2_PGAGAIN_Pos)
#define ADC_CTRL2_VCMSEL_Pos		8
#define ADC_CTRL2_VCMSEL_Msk		(0x07 << ADC_CTRL2_VCMSEL_Pos)
#define ADC_CTRL2_CLKDIV2_Pos		24
#define ADC_CTRL2_CLKDIV2_Msk		(0x1F << ADC_CTRL2_CLKDIV2_Pos)
#define ADC_CTRL2_CLKDIV1_Pos		29
#define ADC_CTRL2_CLKDIV1_Msk		(0x03 << ADC_CTRL2_CLKDIV1_Pos)

#define ADC_CTRL3_REFPSEL_Pos		2		//0 Vrefp pin   1 VDD
#define ADC_CTRL3_REFPSEL_Msk		(0x01 << ADC_CTRL3_REFPSEL_Pos)
#define ADC_CTRL3_CLKDIV0_Pos		3
#define ADC_CTRL3_CLKDIV0_Msk		(0x03 << ADC_CTRL3_CLKDIV0_Pos)

#define ADC_CALIBSET_OFFSET_Pos		0
#define ADC_CALIBSET_OFFSET_Msk		(0x1FF<< ADC_CALIBSET_OFFSET_Pos)
#define ADC_CALIBSET_K_Pos			16
#define ADC_CALIBSET_K_Msk			(0x1FF<< ADC_CALIBSET_K_Pos)

#define ADC_CALIBEN_OFFSET_Pos		0
#define ADC_CALIBEN_OFFSET_Msk		(0x01 << ADC_CALIBEN_OFFSET_Pos)
#define ADC_CALIBEN_K_Pos			1
#define ADC_CALIBEN_K_Msk			(0x01 << ADC_CALIBEN_K_Pos)




typedef struct {
	__IO uint32_t MODE;
	
	__IO uint32_t PERA;                     //[15:0] 周期
	
	__IO uint32_t HIGHA;                    //[16:1] 高电平持续时长    [0] 是否将高电平的下降沿推迟半个时钟周期
	
	__IO uint32_t DZA;                      //[9:0] 死区，即上升沿推迟时长，必须小于HIGHA
	
	__IO uint32_t PERB;
	
	__IO uint32_t HIGHB;
	
	__IO uint32_t DZB;
	
	__IO uint32_t OUTCR;
	
	__IO uint32_t ADTRGA0;					//A路 ADC Trigger Enable
    __IO uint32_t ADTRGA1;
	
	__IO uint32_t BRKEN;					//Brake Enable
	
	__IO uint32_t VALUEA;					//当前计数值
	__IO uint32_t VALUEB;
	
	__IO uint32_t ADTRGB0;					//注意：只有当 PWMxA 通道使能时，PWMxB 通道才能触发 ADC
    __IO uint32_t ADTRGB1;
	
	__IO uint32_t ADTRGDIR;					//中心对称模式下，计数器递增计数时是否触发ADC、计数器递减计数时是否触发ADC
} PWM_TypeDef;


#define PWM_MODE_MODE_Pos			0		//0 边沿对齐模式   1 中心对称模式
#define PWM_MODE_MODE_Msk			(0x07 << PWM_MODE_MODE_Pos)
#define PWM_MODE_CLKSRC_Pos			3		//0 APB    1 APB分频    2 PWM_PULSE0 引脚输入    3 PWM_PULSE1 引脚输入
#define PWM_MODE_CLKSRC_Msk			(0x03 << PWM_MODE_CLKSRC_Pos)
#define PWM_MODE_CLKDIV_Pos			5		//0 1分频    1 2分频    ...
#define PWM_MODE_CLKDIV_Msk			(0xFF << PWM_MODE_CLKDIV_Pos)

#define PWM_OUTCR_INIA_Pos			0		//1 输出从高电平开始
#define PWM_OUTCR_INIA_Msk			(0x01 << PWM_OUTCR_INIA_Pos)
#define PWM_OUTCR_INIB_Pos			1		
#define PWM_OUTCR_INIB_Msk			(0x01 << PWM_OUTCR_INIB_Pos)
#define PWM_OUTCR_INVA_Pos			2		//1 PWMxA 输出取反
#define PWM_OUTCR_INVA_Msk			(0x01 << PWM_OUTCR_INVA_Pos)
#define PWM_OUTCR_INVB_Pos			3
#define PWM_OUTCR_INVB_Msk			(0x01 << PWM_OUTCR_INVB_Pos)
#define PWM_OUTCR_IDLEA_Pos			4		//1 空闲时输出高电平
#define PWM_OUTCR_IDLEA_Msk			(0x01 << PWM_OUTCR_IDLEA_Pos)
#define PWM_OUTCR_IDLEB_Pos			5
#define PWM_OUTCR_IDLEB_Msk			(0x01 << PWM_OUTCR_IDLEB_Pos)
#define PWM_OUTCR_INVAN_Pos			6		//1 PWMxAN 输出取反
#define PWM_OUTCR_INVAN_Msk			(0x01 << PWM_OUTCR_INVAN_Pos)
#define PWM_OUTCR_INVBN_Pos			7
#define PWM_OUTCR_INVBN_Msk			(0x01 << PWM_OUTCR_INVBN_Pos)

#define PWM_ADTRG_MATCH_Pos			0		
#define PWM_ADTRG_MATCH_Msk			(0xFFFF << PWM_ADTRG_MATCH_Pos)
#define PWM_ADTRG_EN_Pos		    16		
#define PWM_ADTRG_EN_Msk		    (0x01 << PWM_ADTRG_EN_Pos)

#define PWM_BRKEN_EN_Pos			0
#define PWM_BRKEN_EN_Msk			(0x01 << PWM_BRKEN_EN_Pos)
#define PWM_BRKEN_S0_Pos			1		//刹车信号0使能
#define PWM_BRKEN_S0_Msk			(0x01 << PWM_BRKEN_S0_Pos)
#define PWM_BRKEN_S1_Pos			2		//刹车信号1使能
#define PWM_BRKEN_S1_Msk			(0x01 << PWM_BRKEN_S1_Pos)
#define PWM_BRKEN_S2_Pos			3		//刹车信号2使能
#define PWM_BRKEN_S2_Msk			(0x01 << PWM_BRKEN_S2_Pos)
#define PWM_BRKEN_OUT_Pos			4		//刹车时PWM输出电平
#define PWM_BRKEN_OUT_Msk			(0x01 << PWM_BRKEN_OUT_Pos)

#define PWM_ADTRGDIR_A0DEC_Pos		0		//中心对称模式下，计数器递减计数时（即后半周期）ADTRGA0是否起作用
#define PWM_ADTRGDIR_A0DEC_Msk		(0x01 << PWM_ADTRGDIR_A0DEC_Pos)
#define PWM_ADTRGDIR_A0INC_Pos		1		//中心对称模式下，计数器递增计数时（即前半周期）ADTRGA0是否起作用
#define PWM_ADTRGDIR_A0INC_Msk		(0x01 << PWM_ADTRGDIR_A0INC_Pos)
#define PWM_ADTRGDIR_A1DEC_Pos		2
#define PWM_ADTRGDIR_A1DEC_Msk		(0x01 << PWM_ADTRGDIR_A1DEC_Pos)
#define PWM_ADTRGDIR_A1INC_Pos		3
#define PWM_ADTRGDIR_A1INC_Msk		(0x01 << PWM_ADTRGDIR_A1INC_Pos)
#define PWM_ADTRGDIR_B0DEC_Pos		4
#define PWM_ADTRGDIR_B0DEC_Msk		(0x01 << PWM_ADTRGDIR_B0DEC_Pos)
#define PWM_ADTRGDIR_B0INC_Pos		5
#define PWM_ADTRGDIR_B0INC_Msk		(0x01 << PWM_ADTRGDIR_B0INC_Pos)
#define PWM_ADTRGDIR_B1DEC_Pos		6
#define PWM_ADTRGDIR_B1DEC_Msk		(0x01 << PWM_ADTRGDIR_B1DEC_Pos)
#define PWM_ADTRGDIR_B1INC_Pos		7
#define PWM_ADTRGDIR_B1INC_Msk		(0x01 << PWM_ADTRGDIR_B1INC_Pos)


