Synwit-Co-Ltd/SWM241_UserBoot/SWM241_UserBoot/CSL/CMSIS/DeviceSupport/SWM241.h
#define RTC_DAYHURAL_HOUR_Pos		0       //闹钟小时设置
#define RTC_DAYHURAL_HOUR_Msk		(0x1F << RTC_DAYHURAL_HOUR_Pos)
#define RTC_DAYHURAL_SUN_Pos		5       //周日闹钟有效
#define RTC_DAYHURAL_SUN_Msk		(0x01 << RTC_DAYHURAL_SUN_Pos)
#define RTC_DAYHURAL_MON_Pos		6       //周一闹钟有效
#define RTC_DAYHURAL_MON_Msk		(0x01 << RTC_DAYHURAL_MON_Pos)
#define RTC_DAYHURAL_TUE_Pos		7       //周二闹钟有效
#define RTC_DAYHURAL_TUE_Msk		(0x01 << RTC_DAYHURAL_TUE_Pos)
#define RTC_DAYHURAL_WED_Pos		8       //周三闹钟有效
#define RTC_DAYHURAL_WED_Msk		(0x01 << RTC_DAYHURAL_WED_Pos)
#define RTC_DAYHURAL_THU_Pos		9       //周四闹钟有效
#define RTC_DAYHURAL_THU_Msk		(0x01 << RTC_DAYHURAL_THU_Pos)
#define RTC_DAYHURAL_FRI_Pos		10      //周五闹钟有效
#define RTC_DAYHURAL_FRI_Msk		(0x01 << RTC_DAYHURAL_FRI_Pos)
#define RTC_DAYHURAL_SAT_Pos		11      //周六闹钟有效
#define RTC_DAYHURAL_SAT_Msk		(0x01 << RTC_DAYHURAL_SAT_Pos)

#define RTC_LOAD_TIME_Pos			0		//将时间、定时、校准相关寄存器中的值加载到RTC时钟域
#define RTC_LOAD_TIME_Msk			(0x01 << RTC_LOAD_TIME_Pos)
#define RTC_LOAD_ALARM_Pos			1		//将闹钟相关寄存器中的值加载到RTC时钟域
#define RTC_LOAD_ALARM_Msk			(0x01 << RTC_LOAD_ALARM_Pos)

#define RTC_IE_SEC_Pos		        0       //秒中断使能
#define RTC_IE_SEC_Msk		        (0x01 << RTC_IE_SEC_Pos)
#define RTC_IE_MIN_Pos		        1
#define RTC_IE_MIN_Msk		        (0x01 << RTC_IE_MIN_Pos)
#define RTC_IE_HOUR_Pos		        2
#define RTC_IE_HOUR_Msk		        (0x01 << RTC_IE_HOUR_Pos)
#define RTC_IE_DATE_Pos		        3
#define RTC_IE_DATE_Msk		        (0x01 << RTC_IE_DATE_Pos)
#define RTC_IE_ALARM_Pos		    4
#define RTC_IE_ALARM_Msk		    (0x01 << RTC_IE_ALARM_Pos)
#define RTC_IE_TRIM_Pos				5		//校准完成中断使能
#define RTC_IE_TRIM_Msk				(0x01 << RTC_IE_TRIM_Pos)
#define RTC_IE_HSEC_Pos				6		//半秒中断使能
#define RTC_IE_HSEC_Msk				(0x01 << RTC_IE_HSEC_Pos)
#define RTC_IE_QSEC_Pos				7		//四分之一秒中断使能
#define RTC_IE_QSEC_Msk				(0x01 << RTC_IE_QSEC_Pos)

#define RTC_IF_SEC_Pos		        0       //写1清零
#define RTC_IF_SEC_Msk		        (0x01 << RTC_IF_SEC_Pos)
#define RTC_IF_MIN_Pos		        1
#define RTC_IF_MIN_Msk		        (0x01 << RTC_IF_MIN_Pos)
#define RTC_IF_HOUR_Pos		        2
#define RTC_IF_HOUR_Msk		        (0x01 << RTC_IF_HOUR_Pos)
#define RTC_IF_DATE_Pos		        3
#define RTC_IF_DATE_Msk		        (0x01 << RTC_IF_DATE_Pos)
#define RTC_IF_ALARM_Pos		    4
#define RTC_IF_ALARM_Msk		    (0x01 << RTC_IF_ALARM_Pos)
#define RTC_IF_TRIM_Pos				5
#define RTC_IF_TRIM_Msk				(0x01 << RTC_IF_TRIM_Pos)
#define RTC_IF_HSEC_Pos				6
#define RTC_IF_HSEC_Msk				(0x01 << RTC_IF_HSEC_Pos)
#define RTC_IF_QSEC_Pos				7
#define RTC_IF_QSEC_Msk				(0x01 << RTC_IF_QSEC_Pos)

#define RTC_TRIM_ADJ_Pos		    0       //用于调整BASECNT的计数周期，默认为32768，如果DEC为1，则计数周期调整为32768-ADJ，否则调整为32768+ADJ
#define RTC_TRIM_ADJ_Msk		    (0xFF << RTC_TRIM_ADJ_Pos)
#define RTC_TRIM_DEC_Pos		    8
#define RTC_TRIM_DEC_Msk		    (0x01 << RTC_TRIM_DEC_Pos)

#define RTC_TRIMM_CYCLE_Pos		    0       //用于计数周期微调，如果INC为1，则第n个计数周期调整为(32768±ADJ)+1,否则调整为(32768±ADJ)-1
                                            //cycles=0时，不进行微调整；cycles=1，则n为2；cycles=7，则n为8；以此类推
#define RTC_TRIMM_CYCLE_Msk		    (0x07 << RTC_TRIMM_CYCLE_Pos)
#define RTC_TRIMM_INC_Pos		    3
#define RTC_TRIMM_INC_Msk		    (0x01 << RTC_TRIMM_INC_Pos)




typedef struct {
	__IO uint32_t CR;
	
	     uint32_t RESERVED[3];
	
	__IO uint32_t DATA[4];
} SLCD_TypeDef;


#define SLCD_CR_DRIVEN_Pos			0		//驱动电路使能		
#define SLCD_CR_DRIVEN_Msk			(0x01 << SLCD_CR_DRIVEN_Pos)
#define SLCD_CR_SCANEN_Pos			1		//扫描电路使能
#define SLCD_CR_SCANEN_Msk			(0x01 << SLCD_CR_SCANEN_Pos)
#define SLCD_CR_DISP_Pos			2		//0 正常显示    1 全部关闭    2 全部显示	
#define SLCD_CR_DISP_Msk			(0x03 << SLCD_CR_DISP_Pos)
#define SLCD_CR_BIAS_Pos			4		//0 1/3 bias    1 1/2 bias
#define SLCD_CR_BIAS_Msk			(0x01 << SLCD_CR_BIAS_Pos)
#define SLCD_CR_DUTY_Pos			5		//0 1/4 duty    1 1/3 duty
#define SLCD_CR_DUTY_Msk			(0x01 << SLCD_CR_DUTY_Pos)
#define SLCD_CR_SCANFRQ_Pos			6		//帧扫描频率 0 32Hz   1 64Hz   2 128Hz   3 256Hz
#define SLCD_CR_SCANFRQ_Msk			(0x03 << SLCD_CR_SCANFRQ_Pos)
#define SLCD_CR_DRIVSEL_Pos			8		//驱动能力 0 8uA   1 25uA   2 50uA   3 100uA
#define SLCD_CR_DRIVSEL_Msk			(0x03 << SLCD_CR_CUR_SEL_Pos)
#define SLCD_CR_KEYSCAN_Pos			10		//按键扫描功能使能
#define SLCD_CR_KEYSCAN_Msk			(0x01 << SLCD_CR_KEYSCAN_Pos)
#define SLCD_CR_CLKDIV_Pos			16
#define SLCD_CR_CLKDIV_Msk			(0x3F << SLCD_CR_CLKDIV_Pos)




typedef struct {
	__IO uint32_t CR;
	
	__IO uint32_t CLKDIV;					//[3:0] 2的CLKDIV次幂分频
	
	__IO uint32_t TIM;
	
	     uint32_t RESERVED;
	
	__IO uint32_t DATA[8];
} SLED_TypeDef;


#define SLED_CR_EN_Pos				0
#define SLED_CR_EN_Msk				(0x01 << SLED_CR_EN_Pos)
#define SLED_CR_DUTY_Pos			1		//0 1/4 Duty    1 1/8 Duty
#define SLED_CR_DUTY_Msk			(0x01 << SLED_CR_DUTY_Pos)
#define SLED_CR_COMINV_Pos			31		//1 COM 波形反相
#define SLED_CR_COMINV_Msk			(0x01u<< SLED_CR_COMINV_Pos)

#define SLED_TIM_PERIOD_Pos			0		//COM周期时间长度
#define SLED_TIM_PERIOD_Msk			(0x3FF<< SLED_TIM_PERIOD_Pos)
#define SLED_TIM_HIGH_Pos			16		//COM周期内COM输出高电平的时间长度
#define SLED_TIM_HIGH_Msk			(0x3FF<< SLED_TIM_HIGH_Pos)




typedef struct {
	__IO uint32_t PERWP;					//Peripheral Write Protect
	
	__IO uint32_t RAMWP;					//RAM Write Protect
	
	__IO uint32_t IAACR;					//Illegal Address Access Contorl Register
	
	__IO uint32_t IF;
	
	__IO uint32_t IE;
	
		 uint32_t RESERVED[3];
	
	struct {
		__IO uint32_t BADDR;				//Region Bottom Address
		
		__IO uint32_t TADDR;				//Region Top Address
	} REGION[4];
} SAFETY_TypeDef;


#define SAFETY_PERWP_IAADEN_Pos		0		//Illegal Address Access Detection Enable
#define SAFETY_PERWP_IAADEN_Msk		(0x01 << SAFETY_PERWP_IAADEN_Pos)
#define SAFETY_PERWP_IER_Pos		1		//Interrupt Enable Registers Write-Protect Enable
#define SAFETY_PERWP_IER_Msk		(0x01 << SAFETY_PERWP_IER_Pos)
#define SAFETY_PERWP_IOCFGR_Pos		2		//IO Configure Registers Write-Protect Enable
#define SAFETY_PERWP_IOCFGR_Msk		(0x01 << SAFETY_PERWP_IOCFGR_Pos)
#define SAFETY_PERWP_CLKCFGR_Pos	3		//Clock Configure Registers Write-Protect Enable
#define SAFETY_PERWP_CLKCFGR_Msk	(0x01 << SAFETY_PERWP_CLKCFGR_Pos)
#define SAFETY_PERWP_ANACFGR_Pos	4		//Analog Configure Registers Write-Protect Enable
#define SAFETY_PERWP_ANACFGR_Msk	(0x01 << SAFETY_PERWP_ANACFGR_Pos)

#define SAFETY_RAMWP_SIZE_Pos		0		//需要写保护的空间大小，0 0 Byte   1 256 Bytes    2 512 Bytes    3 1024 Bytes
#define SAFETY_RAMWP_SIZE_Msk		(0x03 << SAFETY_RAMWP_SIZE_Pos)
#define SAFETY_RAMWP_ADDR_Pos		8		//需要写保护的空间地址，以256字节为单位
#define SAFETY_RAMWP_ADDR_Msk		(0x7F << SAFETY_RAMWP_ADDR_Pos)

#define SAFETY_IAACR_R0INT_Pos		0		//1 Region0 非法访问产生中断    0 Region0 非法访问产生复位
#define SAFETY_IAACR_R0INT_Msk		(0x01 << SAFETY_IAACR_R0INT_Pos)
#define SAFETY_IAACR_R1INT_Pos		1
#define SAFETY_IAACR_R1INT_Msk		(0x01 << SAFETY_IAACR_R1INT_Pos)
#define SAFETY_IAACR_R2INT_Pos		2
#define SAFETY_IAACR_R2INT_Msk		(0x01 << SAFETY_IAACR_R2INT_Pos)
#define SAFETY_IAACR_R3INT_Pos		3
#define SAFETY_IAACR_R3INT_Msk		(0x01 << SAFETY_IAACR_R3INT_Pos)

#define SAFETY_IF_R0_Pos			0		//Region0 非法访问产中断标志
#define SAFETY_IF_R0_Msk			(0x01 << SAFETY_IF_R0_Pos)
#define SAFETY_IF_R1_Pos			1
#define SAFETY_IF_R1_Msk			(0x01 << SAFETY_IF_R1_Pos)
#define SAFETY_IF_R2_Pos			2
#define SAFETY_IF_R2_Msk			(0x01 << SAFETY_IF_R2_Pos)
#define SAFETY_IF_R3_Pos			3
#define SAFETY_IF_R3_Msk			(0x01 << SAFETY_IF_R3_Pos)

#define SAFETY_IE_R0_Pos			0		//Region0 非法访问产中断使能
#define SAFETY_IE_R0_Msk			(0x01 << SAFETY_IE_R0_Pos)
#define SAFETY_IE_R1_Pos			1
#define SAFETY_IE_R1_Msk			(0x01 << SAFETY_IE_R1_Pos)
#define SAFETY_IE_R2_Pos			2
#define SAFETY_IE_R2_Msk			(0x01 << SAFETY_IE_R2_Pos)
#define SAFETY_IE_R3_Pos			3
#define SAFETY_IE_R3_Msk			(0x01 << SAFETY_IE_R3_Pos)




/******************************************************************************/
/*						 Peripheral memory map							  */
/******************************************************************************/
#define RAM_BASE		   	0x20000000
#define AHB_BASE			0x40000000
#define APB1_BASE		 	0x40040000
#define APB2_BASE			0x400A0000

