Synwit-Co-Ltd/SWM241_UserBoot/SWM241_UserBoot/CSL/CMSIS/DeviceSupport/SWM241.h
/* AHB Peripheral memory map */
#define SYS_BASE			(AHB_BASE + 0x0000)
#define DMA_BASE			(AHB_BASE + 0x0800)
#define CRC_BASE			(AHB_BASE + 0x2800)
#define DIV_BASE			(AHB_BASE + 0x3800)

/* APB1 Peripheral memory map */
#define GPIOA_BASE			(APB1_BASE + 0x0000)
#define GPIOB_BASE			(APB1_BASE + 0x0800)
#define GPIOC_BASE			(APB1_BASE + 0x1000)
#define GPIOD_BASE			(APB1_BASE + 0x1800)

#define UART0_BASE			(APB1_BASE + 0x2000)
#define UART1_BASE			(APB1_BASE + 0x2800)
#define UART2_BASE			(APB1_BASE + 0x3000)
#define UART3_BASE			(APB1_BASE + 0x3800)

#define SPI0_BASE			(APB1_BASE + 0x4000)
#define SPI1_BASE			(APB1_BASE + 0x4800)

#define PWM0_BASE			(APB1_BASE + 0x6000)
#define PWM1_BASE			(APB1_BASE + 0x6040)
#define PWM2_BASE			(APB1_BASE + 0x6080)
#define PWM3_BASE			(APB1_BASE + 0x60C0)
#define PWMG_BASE			(APB1_BASE + 0x6200)

#define TIMR0_BASE			(APB1_BASE + 0x6800)
#define TIMR1_BASE			(APB1_BASE + 0x6840)
#define TIMR2_BASE			(APB1_BASE + 0x6880)
#define TIMR3_BASE			(APB1_BASE + 0x68C0)
#define TIMR4_BASE			(APB1_BASE + 0x6900)
#define TIMR5_BASE			(APB1_BASE + 0x6940)
#define TIMR6_BASE			(APB1_BASE + 0x6980)
#define TIMR7_BASE			(APB1_BASE + 0x69C0)
#define TIMRG_BASE			(APB1_BASE + 0x6C00)

#define ADC_BASE			(APB1_BASE + 0x9000)

#define FMC_BASE			(APB1_BASE + 0xA000)

#define RTC_BASE			(APB1_BASE + 0xB800)

/* APB2 Peripheral memory map */
#define PORTA_BASE			(APB2_BASE + 0x0000)
#define PORTB_BASE			(APB2_BASE + 0x0010)
#define PORTC_BASE			(APB2_BASE + 0x0020)
#define PORTD_BASE			(APB2_BASE + 0x0030)

#define WDT_BASE			(APB2_BASE + 0x0800)

#define I2C0_BASE			(APB2_BASE + 0x6000)
#define I2C1_BASE			(APB2_BASE + 0x6800)

#define CAN_BASE			(APB2_BASE + 0x8000)

#define SLCD_BASE			(APB2_BASE + 0x9800)

#define SLED_BASE			(APB2_BASE + 0xA800)

#define SAFETY_BASE			(APB2_BASE + 0xB000)



/******************************************************************************/
/*						 Peripheral declaration							 */
/******************************************************************************/
#define SYS					((SYS_TypeDef  *) SYS_BASE)

#define PORTA				((PORT_TypeDef *) PORTA_BASE)
#define PORTB				((PORT_TypeDef *) PORTB_BASE)
#define PORTC				((PORT_TypeDef *) PORTC_BASE)
#define PORTD				((PORT_TypeDef *) PORTD_BASE)

#define GPIOA				((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB				((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC				((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD				((GPIO_TypeDef *) GPIOD_BASE)

#define TIMR0				((TIMR_TypeDef *) TIMR0_BASE)
#define TIMR1				((TIMR_TypeDef *) TIMR1_BASE)
#define TIMR2				((TIMR_TypeDef *) TIMR2_BASE)
#define TIMR3				((TIMR_TypeDef *) TIMR3_BASE)
#define TIMR4				((TIMR_TypeDef *) TIMR4_BASE)
#define TIMR5				((TIMR_TypeDef *) TIMR5_BASE)
#define TIMR6				((TIMR_TypeDef *) TIMR6_BASE)
#define TIMR7				((TIMR_TypeDef *) TIMR7_BASE)
#define TIMRG				((TIMRG_TypeDef*) TIMRG_BASE)

#define UART0				((UART_TypeDef *) UART0_BASE)
#define UART1				((UART_TypeDef *) UART1_BASE)
#define UART2				((UART_TypeDef *) UART2_BASE)
#define UART3   			((UART_TypeDef *) UART3_BASE)

#define SPI0				((SPI_TypeDef  *) SPI0_BASE)
#define SPI1				((SPI_TypeDef  *) SPI1_BASE)

#define I2C0				((I2C_TypeDef  *) I2C0_BASE)
#define I2C1				((I2C_TypeDef  *) I2C1_BASE)

#define ADC 				((ADC_TypeDef  *) ADC_BASE)

#define PWM0				((PWM_TypeDef  *) PWM0_BASE)
#define PWM1				((PWM_TypeDef  *) PWM1_BASE)
#define PWM2				((PWM_TypeDef  *) PWM2_BASE)
#define PWM3				((PWM_TypeDef  *) PWM3_BASE)
#define PWMG				((PWMG_TypeDef *) PWMG_BASE)

#define DMA 				((DMA_TypeDef  *) DMA_BASE)

#define CAN					((CAN_TypeDef  *) CAN_BASE)

#define FMC					((FMC_TypeDef  *) FMC_BASE)

#define WDT					((WDT_TypeDef  *) WDT_BASE)

#define	DIV					((DIV_TypeDef  *) DIV_BASE)

#define CRC					((CRC_TypeDef  *) CRC_BASE)

#define	RTC					((RTC_TypeDef  *) RTC_BASE)

#define SLCD				((SLCD_TypeDef *) SLCD_BASE)

#define SLED				((SLED_TypeDef *) SLED_BASE)

#define SAFETY				((SAFETY_TypeDef*)SAFETY_BASE)


#include <stdbool.h>

#include "SWM241_port.h"
#include "SWM241_gpio.h"
#include "SWM241_exti.h"
#include "SWM241_timr.h"
#include "SWM241_uart.h"
#include "SWM241_spi.h"
#include "SWM241_i2c.h"
#include "SWM241_pwm.h"
#include "SWM241_adc.h"
#include "SWM241_dma.h"
#include "SWM241_can.h"
#include "SWM241_flash.h"
#include "SWM241_wdt.h"
#include "SWM241_rtc.h"
#include "SWM241_div.h"
#include "SWM241_crc.h"
#include "SWM241_slcd.h"
#include "SWM241_sled.h"
#include "SWM241_sleep.h"
#include "SWM241_safety.h"


#endif //__SWM241_H__
